#include<AT89X51.H>

/***********************************************************
宏定义参数
**********************************************************/
typedef unsigned char  uchar;
typedef unsigned int   uint;


/***********************************************************
管脚定义
***********************************************************/
sbit    RS=P3^4;
sbit    WR1=P3^3;
sbit    E=P3^2;
sbit    RDat=P3^0;
sbit    TD=P3^1;

/***********************************************************
函数列表
**********************************************************/
 delay(uchar b);
 corr(uchar dat);  
 lcd_com(uchar a);
 lcd_dat(uchar b);
 extern lcd_dis(uchar *string,char r); 
 extern lcdinit() ; 